Revit.Elements.Views.PerspectiveView
A Revit View3D

Revit.Elements.Views.PerspectiveView.#ctor(Autodesk.Revit.DB.View3D)
Private constructor

Revit.Elements.Views.PerspectiveView.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoundingBoxXYZ,System.String,System.Boolean)
Private constructor

Revit.Elements.Views.PerspectiveView.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,System.String,System.Boolean)
Private constructor

Revit.Elements.Views.PerspectiveView.InitPerspectiveView(Autodesk.Revit.DB.View3D)
Initialize a PerspectiveView element

Revit.Elements.Views.PerspectiveView.InitPerspectiveView(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoundingBoxXYZ,System.String,System.Boolean)
Initialize a PerspectiveView element

Revit.Elements.Views.PerspectiveView.InitPerspectiveView(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,System.String,System.Boolean)
Initialize a PerspectiveView element

Revit.Elements.Views.PerspectiveView.ByEyePointAndTarget(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Object,System.String,System.Boolean)
Create a Revit Perspective View from an Eye position, a target position, and
either an Element or BoundingBox.
eyePoint: A Point representing the eye point.
target: A Point representing the target of view.
element: This argument cannot be null, and it has to be either a
Revit.Elements.Element or  Revit.GeometryObjectsBoundingBox.
name: The name of the view.
isolateElement: If this argument is set to true, the element or
bounding box will be isolated in the current view by creating a minimum size
crop box around it.
Returns: Returns the resulting PerspectiveView object.

Revit.Elements.Views.PerspectiveView.ByEyePointTargetAndElement(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Revit.Elements.Element,System.String,System.Boolean)
Create a Revit Perspective View from an Eye position and target position and Element
eyePoint:
target:
element:
name:
isolateElement:
Returns:

Revit.Elements.Views.PerspectiveView.ByEyePointTargetAndBoundingBox(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.BoundingBox,System.String,System.Boolean)
Create a Revit Perspective View from an Eye position and target position and Bounding Box
eyePoint: Eye point in meters
target: Target of view in meters
boundingBox: Bounding box represented in meters
name:
isolateElement:
Returns:

Revit.Elements.Views.PerspectiveView.FromExisting(Autodesk.Revit.DB.View3D,System.Boolean)
Create from an existing Revit Element
view:
isRevitOwned:
Returns: